In [88]:
#importing python module
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

In [89]:
#loading the dataset
df = pd.read_csv("Online Retail.csv")

In [90]:
df.head(4)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/10 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/10 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/10 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/10 8:26,3.39,17850.0,United Kingdom

In [91]:
df.tail(4)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/11 12:50,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/11 12:50,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/11 12:50,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/11 12:50,4.95,12680.0,France

In [92]:
df.shape

(541909, 8)

In [93]:
df.columns

Index(['InvoiceNo', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'UnitPrice', 'CustomerID', 'Country'],
      dtype='object')

In [94]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  object
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 33.1+ MB

In [95]:
df.isnull().sum()

InvoiceNo           0
StockCode           0
Description      1454
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     135080
Country             0
dtype: int64

In [96]:
df.dropna(inplace=True)

In [97]:
df.isnull().sum()

InvoiceNo      0
StockCode      0
Description    0
Quantity       0
InvoiceDate    0
UnitPrice      0
CustomerID     0
Country        0
dtype: int64

In [98]:
df.shape

(406829, 8)

In [99]:
df.Country.value_counts()

United Kingdom          361878
Germany                   9495
France                    8491
EIRE                      7485
Spain                     2533
Netherlands               2371
Belgium                   2069
Switzerland               1877
Portugal                  1480
Australia                 1259
Norway                    1086
Italy                      803
Channel Islands            758
Finland                    695
Cyprus                     622
Sweden                     462
Austria                    401
Denmark                    389
Japan                      358
Poland                     341
USA                        291
Israel                     250
Unspecified                244
Singapore                  229
Iceland                    182
Canada                     151
Greece                     146
Malta                      127
United Arab Emirates        68
European Community          61
RSA                         58
Lebanon                     45
Lithuania                   35
Brazil                      32
Czech Republic              30
Bahrain                     17
Saudi Arabia                10
Name: Country, dtype: int64

In [100]:
df_uk = df[df['Country']=='United Kingdom']
#check the shape
df_uk.shape

(361878, 8)

In [101]:
df_uk.describe()

            Quantity      UnitPrice     CustomerID
count  361878.000000  361878.000000  361878.000000
mean       11.077029       3.256007   15547.871368
std       263.129266      70.654731    1594.402590
min    -80995.000000       0.000000   12346.000000
25%         2.000000       1.250000   14194.000000
50%         4.000000       1.950000   15514.000000
75%        12.000000       3.750000   16931.000000
max     80995.000000   38970.000000   18287.000000

In [102]:
df_uk = df_uk[df_uk['Quantity']>0]
df_uk.shape

(354345, 8)

In [104]:
print('Unique number of customer ID present in data-',df_uk.CustomerID.nunique())
print('Unique number of Quantity present in data-',df_uk.Quantity.nunique())
print('Unique number of StockCode present in data-',df_uk.StockCode.nunique())
print('Unique number of Description present in data-',df_uk.Description.nunique())
print('Unique number of InvoiceNo present in data-',df_uk.InvoiceNo.nunique()) 
print('Unique number of InvoiceDate present in data-',df_uk.InvoiceDate.nunique())
print('Unique number of Country present in data-',df_uk.Country.nunique())
print('Unique number of UnitPrice present in data-',df_uk.UnitPrice.nunique())

Unique number of customer ID present in data- 3921
Unique number of Quantity present in data- 294
Unique number of StockCode present in data- 3645
Unique number of Description present in data- 3833
Unique number of InvoiceNo present in data- 16649
Unique number of InvoiceDate present in data- 15615
Unique number of Country present in data- 1
Unique number of UnitPrice present in data- 403

In [108]:
df_uk['date'] = pd.DatetimeIndex(df_uk['InvoiceDate']).date

In [111]:
df_uk

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,date
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/10 8:26,2.55,17850.0,United Kingdom,2010-12-01
1,536365,71053,WHITE METAL LANTERN,6,12/1/10 8:26,3.39,17850.0,United Kingdom,2010-12-01
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/10 8:26,2.75,17850.0,United Kingdom,2010-12-01
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/10 8:26,3.39,17850.0,United Kingdom,2010-12-01
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/10 8:26,3.39,17850.0,United Kingdom,2010-12-01
...,...,...,...,...,...,...,...,...,...
541889,581585,22466,FAIRY TALE COTTAGE NIGHT LIGHT,12,12/9/11 12:31,1.95,15804.0,United Kingdom,2011-12-09
541890,581586,22061,LARGE CAKE STAND HANGING STRAWBERY,8,12/9/11 12:49,2.95,13113.0,United Kingdom,2011-12-09
541891,581586,23275,SET OF 3 HANGING OWLS OLLIE BEAK,24,12/9/11 12:49,1.25,13113.0,United Kingdom,2011-12-09
541892,581586,21217,RED RETROSPOT ROUND CAKE TINS,24,12/9/11 12:49,8.95,13113.0,United Kingdom,2011-12-09
541893,581586,20685,DOORMAT RED RETROSPOT,10,12/9/11 12:49,7.08,13113.0,United Kingdom,2011-12-09

<h3>recency</h3>

In [112]:
df_uk['date'].max()

datetime.date(2011, 12, 9)

In [113]:
df_uk['date'].min()

datetime.date(2010, 12, 1)

In [115]:
#restrict the data to one full year because it's better to use a metric per Months or Years in RFM
df_uk = df_uk[df_uk['InvoiceDate']>= "2010-12-09"]
df_uk.shape

(176137, 9)

In [116]:
df_recency = df_uk.groupby(by='CustomerID', as_index=False)['date'].max()
df_recency.columns = ['CustomerID','LastPurshaceDate']
df_recency.head()

   CustomerID LastPurshaceDate
0     12747.0       2011-08-22
1     12748.0       2011-09-30
2     12749.0       2011-08-01
3     12820.0       2011-09-26
4     12821.0       2011-05-09

In [117]:
today = dt.date(2011,12,9)
print(today)

2011-12-09

In [120]:
df_recency['Recency'] = df_recency['LastPurshaceDate'].apply(lambda x: (today - x).days)
df_recency.head()

   CustomerID LastPurshaceDate  Recency
0     12747.0       2011-08-22      109
1     12748.0       2011-09-30       70
2     12749.0       2011-08-01      130
3     12820.0       2011-09-26       74
4     12821.0       2011-05-09      214

In [126]:
df_recency.drop('LastPurshaceDate',axis=1,inplace=True)

In [130]:
df_recency.head()

   CustomerID  Recency
0     12747.0      109
1     12748.0       70
2     12749.0      130
3     12820.0       74
4     12821.0      214

Frequency

In [124]:
import warnings
warnings.filterwarnings("ignore")

In [125]:
# drop duplicates
df_uk_copy = df_uk
df_uk_copy.drop_duplicates(subset=['InvoiceNo', 'CustomerID'], keep="first", inplace=True)
#calculate frequency of purchases
df_frequency = df_uk_copy.groupby(by=['CustomerID'], as_index=False)['InvoiceNo'].count()
df_frequency.columns = ['CustomerID','Frequency']
df_frequency.head()

   CustomerID  Frequency
0     12747.0          5
1     12748.0         96
2     12749.0          3
3     12820.0          1
4     12821.0          1